OpenDTEF-v2012/tutorials/lagrangian/reactingParcelFoam/verticalChannelLTS/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# create mesh
runApplication blockMesh

restore0Dir

# initialise with potentialFoam solution
runApplication potentialFoam

# run the solver
runApplication $(getApplication)

#------------------------------------------------------------------------------
